danielac32/stm32/programas/kernel (copia)/include/resets.h
#define RESETS_RESET_DONE_PLL_SYS_RESET  _u(0x0)
#define RESETS_RESET_DONE_PLL_SYS_BITS   _u(0x00001000)
#define RESETS_RESET_DONE_PLL_SYS_MSB    _u(12)
#define RESETS_RESET_DONE_PLL_SYS_LSB    _u(12)
#define RESETS_RESET_DONE_PLL_SYS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PIO1
// Description : None
#define RESETS_RESET_DONE_PIO1_RESET  _u(0x0)
#define RESETS_RESET_DONE_PIO1_BITS   _u(0x00000800)
#define RESETS_RESET_DONE_PIO1_MSB    _u(11)
#define RESETS_RESET_DONE_PIO1_LSB    _u(11)
#define RESETS_RESET_DONE_PIO1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PIO0
// Description : None
#define RESETS_RESET_DONE_PIO0_RESET  _u(0x0)
#define RESETS_RESET_DONE_PIO0_BITS   _u(0x00000400)
#define RESETS_RESET_DONE_PIO0_MSB    _u(10)
#define RESETS_RESET_DONE_PIO0_LSB    _u(10)
#define RESETS_RESET_DONE_PIO0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PADS_QSPI
// Description : None
#define RESETS_RESET_DONE_PADS_QSPI_RESET  _u(0x0)
#define RESETS_RESET_DONE_PADS_QSPI_BITS   _u(0x00000200)
#define RESETS_RESET_DONE_PADS_QSPI_MSB    _u(9)
#define RESETS_RESET_DONE_PADS_QSPI_LSB    _u(9)
#define RESETS_RESET_DONE_PADS_QSPI_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PADS_BANK0
// Description : None
#define RESETS_RESET_DONE_PADS_BANK0_RESET  _u(0x0)
#define RESETS_RESET_DONE_PADS_BANK0_BITS   _u(0x00000100)
#define RESETS_RESET_DONE_PADS_BANK0_MSB    _u(8)
#define RESETS_RESET_DONE_PADS_BANK0_LSB    _u(8)
#define RESETS_RESET_DONE_PADS_BANK0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_JTAG
// Description : None
#define RESETS_RESET_DONE_JTAG_RESET  _u(0x0)
#define RESETS_RESET_DONE_JTAG_BITS   _u(0x00000080)
#define RESETS_RESET_DONE_JTAG_MSB    _u(7)
#define RESETS_RESET_DONE_JTAG_LSB    _u(7)
#define RESETS_RESET_DONE_JTAG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_IO_QSPI
// Description : None
#define RESETS_RESET_DONE_IO_QSPI_RESET  _u(0x0)
#define RESETS_RESET_DONE_IO_QSPI_BITS   _u(0x00000040)
#define RESETS_RESET_DONE_IO_QSPI_MSB    _u(6)
#define RESETS_RESET_DONE_IO_QSPI_LSB    _u(6)
#define RESETS_RESET_DONE_IO_QSPI_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_IO_BANK0
// Description : None
#define RESETS_RESET_DONE_IO_BANK0_RESET  _u(0x0)
#define RESETS_RESET_DONE_IO_BANK0_BITS   _u(0x00000020)
#define RESETS_RESET_DONE_IO_BANK0_MSB    _u(5)
#define RESETS_RESET_DONE_IO_BANK0_LSB    _u(5)
#define RESETS_RESET_DONE_IO_BANK0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_I2C1
// Description : None
#define RESETS_RESET_DONE_I2C1_RESET  _u(0x0)
#define RESETS_RESET_DONE_I2C1_BITS   _u(0x00000010)
#define RESETS_RESET_DONE_I2C1_MSB    _u(4)
#define RESETS_RESET_DONE_I2C1_LSB    _u(4)
#define RESETS_RESET_DONE_I2C1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_I2C0
// Description : None
#define RESETS_RESET_DONE_I2C0_RESET  _u(0x0)
#define RESETS_RESET_DONE_I2C0_BITS   _u(0x00000008)
#define RESETS_RESET_DONE_I2C0_MSB    _u(3)
#define RESETS_RESET_DONE_I2C0_LSB    _u(3)
#define RESETS_RESET_DONE_I2C0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_DMA
// Description : None
#define RESETS_RESET_DONE_DMA_RESET  _u(0x0)
#define RESETS_RESET_DONE_DMA_BITS   _u(0x00000004)
#define RESETS_RESET_DONE_DMA_MSB    _u(2)
#define RESETS_RESET_DONE_DMA_LSB    _u(2)
#define RESETS_RESET_DONE_DMA_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_BUSCTRL
// Description : None
#define RESETS_RESET_DONE_BUSCTRL_RESET  _u(0x0)
#define RESETS_RESET_DONE_BUSCTRL_BITS   _u(0x00000002)
#define RESETS_RESET_DONE_BUSCTRL_MSB    _u(1)
#define RESETS_RESET_DONE_BUSCTRL_LSB    _u(1)
#define RESETS_RESET_DONE_BUSCTRL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_ADC
// Description : None
#define RESETS_RESET_DONE_ADC_RESET  _u(0x0)
#define RESETS_RESET_DONE_ADC_BITS   _u(0x00000001)
#define RESETS_RESET_DONE_ADC_MSB    _u(0)
#define RESETS_RESET_DONE_ADC_LSB    _u(0)
#define RESETS_RESET_DONE_ADC_ACCESS "RO"

#define RESET_ADC			(1 << 0)
#define RESET_BUSCTRL		(1 << 1)
#define RESET_DMA			(1 << 2)
#define RESET_I2C0			(1 << 3)
#define RESET_I2C1			(1 << 4)
#define RESET_IO_BANK0		(1 << 5)
#define RESET_IO_QSPI		(1 << 6)
#define RESET_JTAG			(1 << 7)
#define RESET_PADS_BANK0	(1 << 8)
#define RESET_PADS_QSPI		(1 << 9)
#define RESET_PIO0			(1 << 10)
#define RESET_PIO1			(1 << 11)
#define RESET_PLL_SYS		(1 << 12)
#define RESET_PLL_USB		(1 << 13)
#define RESET_PWM			(1 << 14)
#define RESET_RTC			(1 << 15)
#define RESET_SPI0			(1 << 16)
#define RESET_SPI1			(1 << 17)
#define RESET_SYSCFG		(1 << 18)
#define RESET_SYSINFO		(1 << 19)
#define RESET_TBMAN			(1 << 20)
#define RESET_TIMER			(1 << 21)
#define RESET_UART0			(1 << 22)
#define RESET_UART1			(1 << 23)
#define RESET_USBCTRL		(1 << 24)


void reset_set(unsigned int hw);
void reset_release(unsigned int hw);
void reset_release_wait(unsigned int hw);
#endif